# Bending Detail Custom Field Properties Angular Dimensions For Cranks Enabled Property

Source: https://www.revitapidocs.com/2026/8c06ab59-c490-1b33-4d76-d1e516edbb8b.htm

---

| Bending Detail Custom Field Properties Angular Dimensions For Cranks Enabled Property |
| --- |

Identifies if the angular dimensions which has a reference set on a crank will be shown or not.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public bool AngularDimensionsForCranksEnabled { get; set; }
```

```
Public Property AngularDimensionsForCranksEnabled As Boolean
	Get
	Set
```

```
public:
property bool AngularDimensionsForCranksEnabled {
	bool get ();
	void set (bool value);
}
```

```
member AngularDimensionsForCranksEnabled : bool with get, set
```

#### Property Value

Boolean See Also

#### Reference

BendingDetailCustomFieldProperties Class Autodesk.Revit.DB.Structure Namespace